scc2425-tukano/target/classes/Artillery_Tests/create_short_n_blob.yaml
config:
  target: http://127.0.0.1:8080/tukano/rest  # Base target for relative URLs
  phases:
    - name: simple_post_short
      duration: 1 
      arrivalRate: 1 

scenarios:
  - name: TuKanoHome
    flow:
      - post:
          url: /shorts/kgallagher?pwd=easypass
          capture: 
            json: '$'  # Capture the entire response
            as: 'response'  # Store it as 'response'

      - log: "Response from first POST: {{ response }}"  # Log the entire captured response

      - log: "Captured blobUrl: {{ response.blobUrl }}"  # Directly reference blobUrl from the response

      - post:
          url: '{{ response.blobUrl }}'  # Use the full blobUrl directly